tutorials/CFD/25GeomParametrizationSteadyNS/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   uniform 14.855;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    frontAndBackLow
    {
        type            empty;
    }
    walls
    {
        lowReCorrection 0;
        blending        stepwise;
        n               2;
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    step
    {
        lowReCorrection 0;
        blending        stepwise;
        n               2;
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
}


// ************************************************************************* //
